Objective:You will create a MYSQL database to manage data for a fictional library 'Reader Closet'.

In [24]:
import sqlite3 as sql

In [25]:
#Create a connection with a database named library_db

conn=sql.connect('library_db')

In [26]:
#create a cursor object using the connection -allows us to go through the records
cursor=conn.cursor()

In [30]:
#Create a table named members
cursor.execute('''
CREATE TABLE IF NOT EXISTS members(
member_id PRIMARY KEY,
name VARCHAR(50),
email VARCHAR(50),
join_date DATE);
               ''')

In [31]:
conn.commit()

In [33]:
#Create a table named books
cursor.execute('''
CREATE TABLE IF NOT EXISTS books(
book_Id INTEGER PRIMARY KEY,
title VARCHAR(100),
author VARCHAR(100),
published_year INTEGER,
available_copies INTEGER
);
''')

In [37]:
# Insert the provided sample data into the members and books tables
cursor.execute('''
INSERT INTO members(member_id,name,email,join_date)
VALUES(1,'Riya','riyaarya12@gmail.com','2024-01-01');
''')

In [39]:
cursor.execute('''
INSERT INTO members(member_id,name,email,join_date)
VALUES(2,'Neha','nehaaarya78@gmail.com','2024-02-01');
''')

In [40]:
cursor.execute('''
INSERT INTO members(member_id,name,email,join_date)
VALUES(3,'Harshita','harshaarya98@gmail.com','2024-02-04');
''')

In [51]:
cursor.execute('''
                SELECT * FROM members;
               ''')
results_1=cursor.fetchall() #fetch all the records

In [52]:
import pandas as pd
df1=pd.DataFrame(results_1)
df1

   0         1                       2           3
0  1      Riya    riyaarya12@gmail.com  2024-01-01
1  2      Neha   nehaaarya78@gmail.com  2024-02-01
2  3  Harshita  harshaarya98@gmail.com  2024-02-04

In [53]:
#List of all members who joined after January 1,2024.
cursor.execute('''
SELECT * FROM members WHERE join_date > '2024-01-01';
''')
results_2=cursor.fetchall() #fetch all the records

In [56]:
df2=pd.DataFrame(results_2)
df2

   0         1                       2           3
0  2      Neha   nehaaarya78@gmail.com  2024-02-01
1  3  Harshita  harshaarya98@gmail.com  2024-02-04

In [57]:
#Insert the provided sample data into the  books tables
cursor.execute('''
INSERT INTO books(book_Id,title,author,published_year,available_copies)
VALUES(23,'The Great Gatsby','F. Scott Fitzgerald',1925,3);

               
''')

In [58]:
cursor.execute('''
INSERT INTO books(book_Id,title,author,published_year,available_copies)
VALUES(24,'To Kill a Mockingbird','Harper Lee',1960,5);

               
''')

In [60]:
cursor.execute('''
INSERT INTO books(book_Id,title,author,published_year,available_copies)
VALUES( 25,'1984','George Orwell',1949,2);

               
''')

In [62]:
cursor.execute('''
SELECT * FROM books;
               ''')
results_3=cursor.fetchall()

In [63]:
df3=pd.DataFrame(results_3)
df3

    0                      1                    2     3  4
0  23       The Great Gatsby  F. Scott Fitzgerald  1925  3
1  24  To Kill a Mockingbird           Harper Lee  1960  5
2  25                   1984        George Orwell  1949  2

In [65]:
#Find the total number of available copies for all books.

cursor.execute('''
SELECT * FROM books WHERE available_copies > 0;''')
results_4=cursor.fetchall() #fetch all the records

In [ ]:
df4=pd.DataFrame(results_4)
df4

    0                      1                    2     3  4
0  23       The Great Gatsby  F. Scott Fitzgerald  1925  3
1  24  To Kill a Mockingbird           Harper Lee  1960  5
2  25                   1984        George Orwell  1949  2